PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
/*
 * ============================================================================
 * Enhanced RGB-DPL/CBI/LDPL/CSL Controller v6.0
 * For Printed-Droid R2-D2 Replica Display Systems
 * ============================================================================
 *
 * OVERVIEW:
 * ESP32-S3 build for DPL, CBI, LDPL, and CSL using WS2811/WS2812B LEDs.
 * This is the current mainline version and extends the hardened v5.8 base
 * with a dedicated CSL output and configurable VCC commands.
 *
 * MAIN FEATURES:
 * - Fully addressable RGB control for all panels
 * - DPL, CBI, LDPL, and dedicated CSL support
 * - User profiles, color schemes, and personality modes in EEPROM
 * - Serial CLI plus I2C slave support
 * - Configurable voltage monitor via VM / VL / RR
 * - Watchdog, safer timing, and improved buffer handling
 * - LDPL naming in the current UI / CLI
 *
 * VERSION HISTORY:
 * - v5.7: Added fifth TopBlocks animation mode
 * - v5.8: Hardened ESP32-S3 build with watchdog, safer timing, and better buffers
 * - v6.0: Added CSL output, LDPL naming, and configurable VCC commands
 *
 * VERSION 6.0 CHANGES:
 * - Added dedicated CSL output on GPIO13 with 36 LEDs
 * - Added CSL commands: CSLMODE / CSLSPEED / CSLBRIGHTNESS
 * - Renamed Large Logic to LDPL in the current UI and CLI
 * - Kept LLMODE as compatibility alias
 * - Added VCC configuration commands: VM / VL / RR
 * - Default voltage divider set to 100k / 10k
 * - Default voltage thresholds set to 11.5 / 12.0 / 12.5 / 13.0
 *
 * HARDWARE & PINOUT:
 * - Strip A (8 LEDs, D4):  Bottom white (6) + Large red (2)
 * - Strip B (28 LEDs, D5): VU meter
 * - Strip C (24 LEDs, D6): Blue column (6) + Bargraph (18)
 * - Strip D (18 LEDs, D7): Top yellow (9) + Top green (9)
 * - Strip E (43 LEDs, D8): LDPL
 * - Strip F (23 LEDs, D9): CBI matrix (20) + status (3)
 * - Strip G (36 LEDs, D13): CSL
 * - Inputs: D10 left door, D11 right door, D12 voltage monitor
 *
 * ARDUINO IDE NOTES:
 * - Board: LOLIN S3 Mini or ESP32S3 Dev Module
 * - USB CDC On Boot: Enabled
 * - USB Mode: Hardware CDC and JTAG
 * - Upload Mode: UART0 / Hardware CDC
 * - Flash Size: according to board
 * - Partition Scheme: Default / spiffs is fine
 *
 * SERIAL COMMANDS (9600 baud, newline terminated)
 *
 * --- System & Profiles ---
 * CONFIG, EXIT, HELP, STATUS, INFO
 * SAVE <1-5>, LOAD <1-5>, DEFAULT <0-5>
 *
 * --- Global Settings ---
 * BRIGHTNESS <1-100>, SPEED <1-10>, CBISPEED <1-10>
 * SCHEME <name|num>, PERSONALITY <0-4>
 * SEQUENCE <ON|OFF>, VOLTAGE <ON|OFF>
 * VM <0|1>, VL <RED YELLOW GREEN CHARGE>, RR <R1 R2>
 * COLOR <section> <R> <G> <B>
 *
 * --- Panel Modes & Quick Keys ---
 * LDPLMODE <0-3>   (LLMODE kept as alias)
 * CBIMODE <0-6>
 * CSLMODE <0-7>
 * CSLSPEED <1-10>
 * CSLBRIGHTNESS <1-100>
 * BARGRAPH <SPLIT|CLASSIC>
 * TOPBLOCKS <0-4>
 * P0-P4, S0-S7
 */



// ============================================================================
// Libraries
// ============================================================================
#include <FastLED.h>
#include <EEPROM.h>
#include <Wire.h>
#include <esp_task_wdt.h>

// ============================================================================
// System Configuration Constants
// ============================================================================
#define VERSION "6.0.0-ESP32"
#define SYSTEM_VOLTAGE 12

// Watchdog timer (10 seconds)
#define WDT_TIMEOUT 10

// Serial configuration
#define SERIAL_BAUD 9600
#define SERIAL_BUFFER_SIZE 64
#define SERIAL_TIMEOUT_MS 500

// Animation timing constants
#define TOPBLOCK_BASE_INTERVAL 200
#define BLUE_BASE_INTERVAL 500
#define BARGRAPH_BASE_INTERVAL 200
#define BOTTOM_BASE_INTERVAL 200
#define RED_BASE_INTERVAL 500
#define CBI_BASE_INTERVAL 100
#define CBI_ESB_INTERVAL 800
#define LARGLOGIC_BASE_INTERVAL 15
#define SEQUENCE_INTERVAL 15000

// CBI special patterns
#define SPECIAL_PATTERN_INTERVAL 200

// Startup sequence timing
#define STARTUP_LED_DELAY 5
#define STARTUP_FLASH_DELAY 50

// ============================================================================
// ANSI Color Codes (Fixed escape sequences)
// ============================================================================
#define ANSI_COLOR_RED     "\x1b[31m"
#define ANSI_COLOR_GREEN   "\x1b[32m"
#define ANSI_COLOR_YELLOW  "\x1b[33m"
#define ANSI_COLOR_CYAN    "\x1b[36m"
#define ANSI_STYLE_BOLD    "\x1b[1m"
#define ANSI_COLOR_RESET   "\x1b[0m"

// ============================================================================
// Pin Definitions (Safe pins for ESP32-S3 Mini)
// ============================================================================
#define LEFT_DOOR_PIN  10
#define RIGHT_DOOR_PIN 11
#define ANALOG_INPUT   12

// LED Data Pins
#define DATA_PIN_A 4
#define DATA_PIN_B 5
#define DATA_PIN_C 6
#define DATA_PIN_D 7
#define DATA_PIN_E 8
#define DATA_PIN_F 9
#define DATA_PIN_G 13

// LED Counts per strip
#define NUM_LEDS_A 8
#define NUM_LEDS_B 28
#define NUM_LEDS_C 24
#define NUM_LEDS_D 18
#define NUM_LEDS_E 43
#define NUM_LEDS_F 23
#define NUM_LEDS_G 36
#define TOTAL_LEDS (NUM_LEDS_A + NUM_LEDS_B + NUM_LEDS_C + NUM_LEDS_D + NUM_LEDS_E + NUM_LEDS_F + NUM_LEDS_G)

// CBI Matrix configuration
#define CBI_MATRIX_LEDS 20
#define CBI_STATUS_LEDS 3

// ============================================================================
// Voltage Monitor Configuration (Universal 12V-24V)
// ============================================================================
float GREEN_VCC, YELLOW_VCC, RED_VCC;
#define DEFAULT_VOLTAGE_R1 100000.0f
#define DEFAULT_VOLTAGE_R2 10000.0f
#define DEFAULT_LIMIT_RED 11.5f
#define DEFAULT_LIMIT_YELLOW 12.0f
#define DEFAULT_LIMIT_GREEN 12.5f
#define DEFAULT_LIMIT_CHARGE 13.0f
#define ADC_MAX_VALUE 4095.0f
#define ADC_REFERENCE_VOLTAGE 3.3f

// ============================================================================
// Configuration Enumerations
// ============================================================================
enum ColorScheme { 
    CLASSIC, BLUE, PINK, GREEN, CYBERPUNK, FOREST, SUNSET, CUSTOM, 
    SCHEME_COUNT 
};

