PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
enum Personality { 
    NORMAL, HAPPY, GRUMPY, EXCITED, SLEEPY, 
    PERS_COUNT 
};

enum LEDSection { 
    SEC_TOP_YELLOW, SEC_TOP_GREEN, SEC_BLUE_COLUMN, 
    SEC_BARGRAPH_LOW, SEC_BARGRAPH_MID, SEC_BARGRAPH_HIGH, 
    SEC_BOTTOM_WHITE, SEC_RED_LARGE, SEC_VU_METER, 
    SEC_CBI_MATRIX, SEC_CBI_STATUS, SEC_LDPL, SEC_CSL,
    SEC_COUNT 
};

enum TopBlocksMode {
    TOPBLOCKS_CLASSIC = 0,
    TOPBLOCKS_HORIZONTAL = 1,
    TOPBLOCKS_PAIRED = 2,
    TOPBLOCKS_CHAOS = 3,
    TOPBLOCKS_SINGLE = 4,
    TOPBLOCKS_MODE_COUNT = 5
};

// ============================================================================
// Configuration Structures
// ============================================================================
struct UserProfile {
    char name[16];
    uint8_t brightness;
    uint8_t animSpeed;
    uint8_t cbiSpeed;
    uint8_t colorScheme;
    uint8_t personality;
    uint8_t ldplMode;
    uint8_t cbiMode;
    uint8_t cslMode;
    bool bargraphSplit;
    bool sequenceMode;
    bool voltageMonitorEnabled;
    uint8_t topBlocksMode;
    uint8_t cslSpeed;
    uint8_t cslBrightness;
    CRGB customColors[SEC_COUNT];
    uint16_t checksum;
};

struct SystemConfig {
    uint8_t defaultProfile;
    uint16_t bootCount;
    float voltageR1;
    float voltageR2;
    float limitRed;
    float limitYellow;
    float limitGreen;
    float limitCharge;
    bool monitorVccEnabled;
    uint16_t checksum;
};

// ============================================================================
// PROGMEM Data (Patterns & Lookup Tables) - CORRECTED SIZES
// ============================================================================
const int8_t SMILEY_PATTERN[20] PROGMEM = { 
    0, 1, 1, 1, 0, 
    1, 0, 0, 0, 1, 
    1, 1, 0, 1, 1, 
    0, 0, 1, 0, 0
};

const int8_t HEART_PATTERN[20] PROGMEM = { 
    0, 1, 0, 1, 0, 
    1, 1, 1, 1, 1, 
    1, 1, 1, 1, 1, 
    0, 1, 1, 1, 0
};

const int8_t ESB_PATTERNS[28][20] PROGMEM = {
    {0,0,0,0,0, 0,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0},
    {0,0,0,0,0, 0,0,0,0,0, 0,0,0,1,0, 0,0,0,0,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0, 0,0,0,0,0},
    {1,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0, 1,1,0,0,0},
    {0,0,0,1,0, 0,0,0,1,0, 0,0,0,1,0, 1,1,0,0,0},
    {0,0,0,1,0, 0,0,0,1,0, 0,0,0,1,0, 0,1,0,0,0},
    {0,0,0,1,0, 0,0,0,1,0, 0,0,0,1,0, 0,0,0,0,0},
    {0,0,0,1,0, 0,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0},
    {0,0,0,1,0, 0,0,1,1,0, 0,0,0,0,0, 0,0,1,1,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,0,0,0,0, 0,0,0,0,0},
    {0,0,0,0,0, 0,0,0,0,0, 0,0,0,1,0, 0,0,0,0,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0, 0,0,0,0,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,0,0,0,0, 0,0,0,1,0},
    {1,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0, 1,0,1,1,0},
    {1,0,0,0,0, 0,1,0,1,0, 0,0,0,1,0, 1,0,1,0,0},
    {1,0,0,0,0, 0,1,0,1,0, 0,0,0,1,0, 1,0,0,0,0},
    {1,0,0,0,0, 0,0,1,0,0, 0,0,0,1,0, 1,1,0,0,0},
    {1,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0, 1,1,0,0,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,0,0,0,0, 0,0,0,0,0},
    {1,0,0,0,0, 0,0,0,1,0, 0,0,0,1,0, 0,1,1,0,0},
    {1,0,0,0,0, 1,0,0,0,0, 0,1,0,1,0, 0,0,0,0,0},
    {0,0,0,0,0, 0,0,1,0,0, 0,1,0,1,1, 0,1,0,0,0},
    {0,0,0,0,0, 0,0,0,1,1, 0,1,0,1,1, 0,1,0,0,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,1,0,1,1, 0,1,0,0,0},
    {1,0,0,0,1, 0,0,1,0,0, 0,1,0,0,1, 0,1,0,0,0},
    {0,0,0,0,0, 0,0,0,0,0, 0,0,0,0,1, 0,0,0,0,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,1,0,0,1, 0,1,0,0,0},
    {0,0,0,0,0, 0,0,0,1,0, 0,1,0,0,1, 0,1,0,0,0}
};

// Personality parameters: [speed_mult*10, cbi_mult*10, hue_shift, organic_offset]
const int8_t PERSONALITY_PARAMS[][4] PROGMEM = { 
    {10, 10, 0, 4},    // NORMAL
    {15, 12, 30, 5},   // HAPPY
    {5, 8, -30, 3},    // GRUMPY
    {20, 15, 0, 6},    // EXCITED
    {3, 5, -60, 2}     // SLEEPY
};

// Color scheme names for help menu
const char scheme_name_0[] PROGMEM = "CLASSIC";
const char scheme_name_1[] PROGMEM = "BLUE";
const char scheme_name_2[] PROGMEM = "PINK";
const char scheme_name_3[] PROGMEM = "GREEN";
const char scheme_name_4[] PROGMEM = "CYBERPUNK";
const char scheme_name_5[] PROGMEM = "FOREST";
const char scheme_name_6[] PROGMEM = "SUNSET";
const char scheme_name_7[] PROGMEM = "CUSTOM";

const char* const SCHEME_NAMES[] PROGMEM = {
    scheme_name_0, scheme_name_1, scheme_name_2, scheme_name_3,
    scheme_name_4, scheme_name_5, scheme_name_6, scheme_name_7
};

// ============================================================================
// Global Variables & Objects
// ============================================================================
CRGB leds_a[NUM_LEDS_A];
CRGB leds_b[NUM_LEDS_B];
CRGB leds_c[NUM_LEDS_C];
CRGB leds_d[NUM_LEDS_D];
CRGB leds_e[NUM_LEDS_E];
CRGB leds_f[NUM_LEDS_F];
CRGB leds_g[NUM_LEDS_G];

UserProfile currentProfile;
SystemConfig sysConfig;
bool configMode = false;
CRGB colorTable[SEC_COUNT];

// Animation state variables
uint8_t gHue = 0;
uint8_t lHue = 0;
uint8_t esbCounter = 0;
byte bargraphData[2] = {3, 3};

// Serial command buffer
char serialBuffer[SERIAL_BUFFER_SIZE];
byte serialBufferPos = 0;
bool isWaitingForCommand = false;
uint32_t lastSerialActivityTime = 0;

// I2C with critical section protection (CORRECTED for ISR use)
portMUX_TYPE i2cMux = portMUX_INITIALIZER_UNLOCKED;
volatile uint8_t i2cCommand = 0;
volatile bool i2cCommandReady = false;

// ============================================================================
// Overflow-Safe Timer Class
// ============================================================================
class Timer {
private:
    uint32_t lastTime;
    uint32_t interval;
    
public:
    Timer(uint32_t ms) : lastTime(0), interval(ms) {}
    
    void setInterval(uint32_t ms) {
        interval = ms;
    }
    
    // Overflow-safe timer check
    bool ready() {
        uint32_t currentTime = millis();
        uint32_t elapsed = currentTime - lastTime;
        
        if (elapsed >= interval) {
            lastTime = currentTime;
            return true;
        }
        return false;
    }
    
    void reset() {
        lastTime = millis();
    }
};

// Animation timers
Timer topBlockTimer(TOPBLOCK_BASE_INTERVAL);
Timer blueTimer(BLUE_BASE_INTERVAL);
Timer bargraphTimer(BARGRAPH_BASE_INTERVAL);
Timer bottomTimer(BOTTOM_BASE_INTERVAL);
Timer redTimer(RED_BASE_INTERVAL);
Timer cbiTimer(CBI_BASE_INTERVAL);
Timer ldplTimer(LARGLOGIC_BASE_INTERVAL);
Timer cslTimer(80);
Timer sequenceTimer(SEQUENCE_INTERVAL);

// ============================================================================
// EEPROM Management
// ============================================================================
#define EEPROM_MAGIC 0xDEAD
#define EEPROM_SYS_ADDR 0
#define EEPROM_PROFILE_ADDR(x) (sizeof(SystemConfig) + ((x) * sizeof(UserProfile)))
const int EEPROM_SIZE = sizeof(SystemConfig) + (5 * sizeof(UserProfile));

uint16_t calculateChecksum(void* data, size_t size) {
    uint16_t sum = 0;
    uint8_t* bytes = (uint8_t*)data;
    for (size_t i = 0; i < size - 2; i++) {
        sum += bytes[i];
    }
    return sum ^ EEPROM_MAGIC;
}

bool saveSystemConfig() {
    sysConfig.checksum = calculateChecksum(&sysConfig, sizeof(SystemConfig));
    EEPROM.put(EEPROM_SYS_ADDR, sysConfig);
    return EEPROM.commit();
}

