PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
bool loadSystemConfig() {
    EEPROM.get(EEPROM_SYS_ADDR, sysConfig);
    
    if (sysConfig.checksum != calculateChecksum(&sysConfig, sizeof(SystemConfig))) {
        Serial.println(F("System config invalid, initializing defaults"));
        sysConfig.defaultProfile = 0;
        sysConfig.bootCount = 0;
        sysConfig.voltageR1 = DEFAULT_VOLTAGE_R1;
        sysConfig.voltageR2 = DEFAULT_VOLTAGE_R2;
        sysConfig.limitRed = DEFAULT_LIMIT_RED;
        sysConfig.limitYellow = DEFAULT_LIMIT_YELLOW;
        sysConfig.limitGreen = DEFAULT_LIMIT_GREEN;
        sysConfig.limitCharge = DEFAULT_LIMIT_CHARGE;
        sysConfig.monitorVccEnabled = false;
        return saveSystemConfig();
    }
    
    sysConfig.bootCount++;
    return saveSystemConfig();
}

// Forward declarations
void applyProfile();
void updateColorTable();

bool loadProfile(uint8_t profileNum) {
    if (profileNum >= 5) {
        Serial.println(F("ERROR: Invalid profile number"));
        return false;
    }
    
    UserProfile temp;
    EEPROM.get(EEPROM_PROFILE_ADDR(profileNum), temp);
    
    if (temp.checksum == calculateChecksum(&temp, sizeof(UserProfile))) {
        currentProfile = temp;
        currentProfile.voltageMonitorEnabled = sysConfig.monitorVccEnabled;
        applyProfile();
        Serial.print(F("Loaded profile "));
        Serial.println(profileNum + 1);
        return true;
    } else {
        Serial.print(F("Profile "));
        Serial.print(profileNum + 1);
        Serial.println(F(" is empty or corrupted"));
        return false;
    }
}

bool saveProfile(uint8_t profileNum) {
    if (profileNum >= 5) {
        Serial.println(F("ERROR: Invalid profile number"));
        return false;
    }
    
    currentProfile.checksum = calculateChecksum(&currentProfile, sizeof(UserProfile));
    EEPROM.put(EEPROM_PROFILE_ADDR(profileNum), currentProfile);
    
    if (EEPROM.commit()) {
        Serial.print(F("Saved to profile "));
        Serial.println(profileNum + 1);
        return true;
    } else {
        Serial.println(F("ERROR: EEPROM commit failed"));
        return false;
    }
}

void initDefaultProfile() {
    strcpy(currentProfile.name, "Default");
    currentProfile.brightness = 25;
    currentProfile.animSpeed = 5;
    currentProfile.cbiSpeed = 3;
    currentProfile.colorScheme = CLASSIC;
    currentProfile.personality = NORMAL;
    currentProfile.ldplMode = 0;
    currentProfile.cbiMode = 0;
    currentProfile.cslMode = 1;
    currentProfile.bargraphSplit = false;
    currentProfile.topBlocksMode = TOPBLOCKS_CLASSIC;
    currentProfile.sequenceMode = false;
    currentProfile.voltageMonitorEnabled = sysConfig.monitorVccEnabled;
    currentProfile.cslSpeed = 5;
    currentProfile.cslBrightness = 25;
    memset(currentProfile.customColors, 0, sizeof(currentProfile.customColors));
    applyProfile();
}

// ============================================================================
// Color Management
// ============================================================================
void updateColorTable() {
    // Apply base color scheme
    switch (currentProfile.colorScheme) {
        case CLASSIC:
            colorTable[SEC_TOP_YELLOW] = CRGB::Yellow;
            colorTable[SEC_TOP_GREEN] = CRGB::Green;
            colorTable[SEC_BLUE_COLUMN] = CRGB::Blue;
            colorTable[SEC_BARGRAPH_LOW] = CRGB::Green;
            colorTable[SEC_BARGRAPH_MID] = CRGB::Yellow;
            colorTable[SEC_BARGRAPH_HIGH] = CRGB::Red;
            colorTable[SEC_BOTTOM_WHITE] = CRGB::White;
            colorTable[SEC_RED_LARGE] = CRGB::Red;
            colorTable[SEC_CBI_MATRIX] = CRGB::Red;
            colorTable[SEC_CBI_STATUS] = CRGB::Red;
            colorTable[SEC_LDPL] = CRGB::Blue;
            colorTable[SEC_CSL] = CRGB::Blue;
            break;
            
        case BLUE:
            colorTable[SEC_TOP_YELLOW] = CRGB::Cyan;
            colorTable[SEC_TOP_GREEN] = CRGB::Blue;
            colorTable[SEC_BLUE_COLUMN] = CRGB::DeepSkyBlue;
            colorTable[SEC_BARGRAPH_LOW] = CRGB::Blue;
            colorTable[SEC_BARGRAPH_MID] = CRGB::Cyan;
            colorTable[SEC_BARGRAPH_HIGH] = CRGB::White;
            colorTable[SEC_BOTTOM_WHITE] = CRGB::LightBlue;
            colorTable[SEC_RED_LARGE] = CRGB::Blue;
            colorTable[SEC_CBI_MATRIX] = CRGB::Blue;
            colorTable[SEC_CBI_STATUS] = CRGB::White;
            colorTable[SEC_LDPL] = CRGB::DeepSkyBlue;
            colorTable[SEC_CSL] = CRGB::Blue;
            break;
            
        case PINK:
            colorTable[SEC_TOP_YELLOW] = CRGB::HotPink;
            colorTable[SEC_TOP_GREEN] = CRGB::Magenta;
            colorTable[SEC_BLUE_COLUMN] = CRGB::DeepPink;
            colorTable[SEC_BARGRAPH_LOW] = CRGB::HotPink;
            colorTable[SEC_BARGRAPH_MID] = CRGB::DeepPink;
            colorTable[SEC_BARGRAPH_HIGH] = CRGB::Magenta;
            colorTable[SEC_BOTTOM_WHITE] = CRGB::HotPink;
            colorTable[SEC_RED_LARGE] = CRGB::DeepPink;
            colorTable[SEC_CBI_MATRIX] = CRGB::Magenta;
            colorTable[SEC_CBI_STATUS] = CRGB::HotPink;
            colorTable[SEC_LDPL] = CRGB::Magenta;
            colorTable[SEC_CSL] = CRGB::DeepPink;
            break;
            
        case GREEN:
            colorTable[SEC_TOP_YELLOW] = CRGB::YellowGreen;
            colorTable[SEC_TOP_GREEN] = CRGB::Green;
            colorTable[SEC_BLUE_COLUMN] = CRGB::SeaGreen;
            colorTable[SEC_BARGRAPH_LOW] = CRGB::DarkGreen;
            colorTable[SEC_BARGRAPH_MID] = CRGB::Green;
            colorTable[SEC_BARGRAPH_HIGH] = CRGB::Lime;
            colorTable[SEC_BOTTOM_WHITE] = CRGB::PaleGreen;
            colorTable[SEC_RED_LARGE] = CRGB::ForestGreen;
            colorTable[SEC_CBI_MATRIX] = CRGB::Green;
            colorTable[SEC_CBI_STATUS] = CRGB::Lime;
            colorTable[SEC_LDPL] = CRGB::SeaGreen;
            colorTable[SEC_CSL] = CRGB::Green;
            break;
            
        case CYBERPUNK:
            colorTable[SEC_TOP_YELLOW] = CRGB::Magenta;
            colorTable[SEC_TOP_GREEN] = CRGB::Purple;
            colorTable[SEC_BLUE_COLUMN] = CRGB::Cyan;
            colorTable[SEC_BARGRAPH_LOW] = CRGB::DeepPink;
            colorTable[SEC_BARGRAPH_MID] = CRGB::Cyan;
            colorTable[SEC_BARGRAPH_HIGH] = CRGB::Yellow;
            colorTable[SEC_BOTTOM_WHITE] = CRGB::LightCyan;
            colorTable[SEC_RED_LARGE] = CRGB::Magenta;
            colorTable[SEC_CBI_MATRIX] = CRGB::Cyan;
            colorTable[SEC_CBI_STATUS] = CRGB::Yellow;
            colorTable[SEC_LDPL] = CRGB::Cyan;
            colorTable[SEC_CSL] = CRGB::DeepPink;
            break;
            
