PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
        case FOREST:
            colorTable[SEC_TOP_YELLOW] = CRGB::Orange;
            colorTable[SEC_TOP_GREEN] = CRGB::DarkGreen;
            colorTable[SEC_BLUE_COLUMN] = CRGB::SeaGreen;
            colorTable[SEC_BARGRAPH_LOW] = CRGB::Green;
            colorTable[SEC_BARGRAPH_MID] = CRGB::Brown;
            colorTable[SEC_BARGRAPH_HIGH] = CRGB::Orange;
            colorTable[SEC_BOTTOM_WHITE] = CRGB::LightGoldenrodYellow;
            colorTable[SEC_RED_LARGE] = CRGB::DarkOrange;
            colorTable[SEC_CBI_MATRIX] = CRGB::DarkGreen;
            colorTable[SEC_CBI_STATUS] = CRGB::Orange;
            colorTable[SEC_LDPL] = CRGB::DarkGreen;
            colorTable[SEC_CSL] = CRGB::Orange;
            break;
            
        case SUNSET:
            colorTable[SEC_TOP_YELLOW] = CRGB::OrangeRed;
            colorTable[SEC_TOP_GREEN] = CRGB::DarkViolet;
            colorTable[SEC_BLUE_COLUMN] = CRGB::Orange;
            colorTable[SEC_BARGRAPH_LOW] = CRGB::Orange;
            colorTable[SEC_BARGRAPH_MID] = CRGB::Red;
            colorTable[SEC_BARGRAPH_HIGH] = CRGB::DarkViolet;
            colorTable[SEC_BOTTOM_WHITE] = CRGB::Gold;
            colorTable[SEC_RED_LARGE] = CRGB::OrangeRed;
            colorTable[SEC_CBI_MATRIX] = CRGB::DarkViolet;
            colorTable[SEC_CBI_STATUS] = CRGB::OrangeRed;
            colorTable[SEC_LDPL] = CRGB::DarkViolet;
            colorTable[SEC_CSL] = CRGB::Orange;
            break;
            
        case CUSTOM:
            memcpy(colorTable, currentProfile.customColors, sizeof(colorTable));
            break;
    }
    
    // Apply personality hue shift
    int8_t persParams[4];
    memcpy_P(persParams, PERSONALITY_PARAMS[currentProfile.personality], sizeof(persParams));
    int8_t hueShift = persParams[2];
    
    if (hueShift != 0) {
        for (int i = 0; i < SEC_COUNT; i++) {
            CHSV hsv = rgb2hsv_approximate(colorTable[i]);
            hsv.h = (uint8_t)((int16_t)hsv.h + hueShift);
            colorTable[i] = hsv;
        }
    }
}

void applyProfile() {
    // Only update brightness if it changed
    static uint8_t lastBrightness = 255;
    if (currentProfile.brightness != lastBrightness) {
        FastLED.setBrightness(map(currentProfile.brightness, 1, 100, 10, 255));
        lastBrightness = currentProfile.brightness;
    }
    updateColorTable();
}

// ============================================================================
// I2C Handler (CORRECTED - Using Critical Sections for ISR)
// ============================================================================
void i2cReceiveEvent(int bytes) {
    if (Wire.available()) {
        portENTER_CRITICAL_ISR(&i2cMux);
        i2cCommand = Wire.read();
        i2cCommandReady = true;
        portEXIT_CRITICAL_ISR(&i2cMux);
    }
}

void processI2CCommand() {
    // The flag was already reset in a thread-safe way in loop()
    // Future: Add I2C command handling here using the value of 'i2cCommand'
}

// ============================================================================
// Help & Status Display
// ============================================================================
void printHelp() {
    Serial.println(F(""));
    Serial.println(ANSI_STYLE_BOLD ANSI_COLOR_CYAN "=== R2-D2 Display Controller v6.0 ===" ANSI_COLOR_RESET);
    Serial.println(F("Syntax: COMMAND <parameter>"));
    
    Serial.println(ANSI_STYLE_BOLD ANSI_COLOR_YELLOW "\n== SYSTEM ==" ANSI_COLOR_RESET);
    Serial.println(F("  CONFIG              - Enter configuration mode"));
    Serial.println(F("  EXIT                - Exit configuration mode"));
    Serial.println(F("  HELP                - Show this help"));
    Serial.println(F("  STATUS              - Display current settings"));
    Serial.println(F("  INFO                - System information & diagnostics"));
    Serial.println(F("  SAVE <1-5>          - Save current settings to profile"));
    Serial.println(F("  LOAD <1-5>          - Load settings from profile"));
    Serial.println(F("  DEFAULT <0-5>       - Set boot profile (0=disabled)"));
    
    Serial.println(ANSI_STYLE_BOLD ANSI_COLOR_YELLOW "\n== GLOBAL SETTINGS ==" ANSI_COLOR_RESET);
    Serial.println(F("  BRIGHTNESS <1-100>  - Master brightness"));
    Serial.println(F("  SPEED <1-10>        - DPL animation speed"));
    Serial.println(F("  CBISPEED <1-10>     - CBI animation speed"));
    Serial.println(F("  SEQUENCE <ON|OFF>   - Auto-cycle animations"));
    Serial.println(F("  VOLTAGE <ON|OFF>    - CBI voltage monitor"));
    Serial.println(F("  VM <0|1>            - Global VCC monitor enable"));
    Serial.println(F("  VL <R Y G C>        - VCC limits red/yellow/green/charge"));
    Serial.println(F("  RR <R1 R2>          - Voltage divider resistor values"));
    Serial.println(F("  PERSONALITY <0-4>   - 0:Normal 1:Happy 2:Grumpy 3:Excited 4:Sleepy"));
    Serial.println(F("  SCHEME <name|num>   - Color scheme (see list below)"));
    Serial.println(F("  COLOR <s r g b>     - Custom section color (0-12; 11=LDPL, 12=CSL)"));
    
    Serial.println(ANSI_STYLE_BOLD ANSI_COLOR_YELLOW "\n-- Color Schemes --" ANSI_COLOR_RESET);
    for (int i = 0; i < SCHEME_COUNT; i++) {
        const char* namePtr = (const char*)pgm_read_ptr(&SCHEME_NAMES[i]);
        Serial.print(F("  "));
        Serial.print(i);
        Serial.print(F(": "));
        Serial.println(namePtr);  // Direct print from PROGMEM - more efficient
    }
    
    Serial.println(ANSI_STYLE_BOLD ANSI_COLOR_YELLOW "\n== PANEL MODES ==" ANSI_COLOR_RESET);
    Serial.println(F("  LDPLMODE <0-3>      - LDPL (0:Breathe 1:Rainbow 2:Off 3:Personality)"));
    Serial.println(F("  LLMODE <0-3>        - Legacy alias for LDPLMODE"));
    Serial.println(F("  CBIMODE <0-6>       - CBI Display (0:Organic 1:ESB 2:Rainbow...)"));
    Serial.println(F("  CSLMODE <0-7>       - CSL (0:Off 1:Default 2:Static 3:Glow 4-7:Running)"));
    Serial.println(F("  CSLSPEED <1-10>     - CSL animation speed"));
    Serial.println(F("  CSLBRIGHTNESS <1-100> - CSL relative brightness"));
    Serial.println(F("  BARGRAPH <SPLIT|CLASSIC> - Bargraph style"));
    Serial.println(F("  TOPBLOCKS <0-4>     - 0:Classic 1:Horizontal 2:Paired 3:Chaos 4:Single"));
    Serial.println(F("============================================"));
}

