PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
void printStatus() {
    Serial.println(F("\n=== Current Status ==="));
    Serial.print(F("Profile: ")); Serial.println(currentProfile.name);
    Serial.print(F("Brightness: ")); Serial.print(currentProfile.brightness);
    Serial.print(F("% | Speed: ")); Serial.print(currentProfile.animSpeed);
    Serial.print(F(" | CBI Speed: ")); Serial.println(currentProfile.cbiSpeed);
    
    Serial.print(F("Personality: "));
    switch(currentProfile.personality) {
        case NORMAL: Serial.print(F("Normal")); break;
        case HAPPY: Serial.print(F("Happy")); break;
        case GRUMPY: Serial.print(F("Grumpy")); break;
        case EXCITED: Serial.print(F("Excited")); break;
        case SLEEPY: Serial.print(F("Sleepy")); break;
    }
    Serial.print(F(" | Scheme: "));
    Serial.println(currentProfile.colorScheme);
    
    Serial.print(F("Sequence: "));
    Serial.print(currentProfile.sequenceMode ? "ON" : "OFF");
    Serial.print(F(" | Voltage: "));
    Serial.println(currentProfile.voltageMonitorEnabled ? "ON" : "OFF");
    
    Serial.print(F("LDPL Mode: ")); Serial.print(currentProfile.ldplMode);
    Serial.print(F(" | CBI Mode: ")); Serial.print(currentProfile.cbiMode);
    Serial.print(F(" | CSL Mode: ")); Serial.println(currentProfile.cslMode);

    Serial.print(F("CSL Speed: ")); Serial.print(currentProfile.cslSpeed);
    Serial.print(F(" | CSL Brightness: ")); Serial.print(currentProfile.cslBrightness);
    Serial.println(F("%"));

    Serial.print(F("VCC Divider: "));
    Serial.print(sysConfig.voltageR1, 0);
    Serial.print(F("/"));
    Serial.print(sysConfig.voltageR2, 0);
    Serial.print(F(" | Limits R/Y/G/C: "));
    Serial.print(sysConfig.limitRed, 2);
    Serial.print(F("/"));
    Serial.print(sysConfig.limitYellow, 2);
    Serial.print(F("/"));
    Serial.print(sysConfig.limitGreen, 2);
    Serial.print(F("/"));
    Serial.println(sysConfig.limitCharge, 2);

    Serial.print(F(" | Bargraph: "));
    Serial.println(currentProfile.bargraphSplit ? "Split" : "Classic");
    
    Serial.print(F("Top Blocks: "));
    Serial.println(currentProfile.topBlocksMode);
    Serial.println(F("====================="));
}

// ============================================================================
// Serial Command Parser
// ============================================================================
void processSerialCommand() {
    // Work directly with serialBuffer to avoid extra copy
    char* command = strtok(serialBuffer, " ");
    if (command == NULL) return;
    
    // Convert command to uppercase in-place
    for (char* p = command; *p; p++) {
        *p = toupper(*p);
    }
    
    // Get first argument and convert to uppercase
    char* arg1 = strtok(NULL, " ");
    if (arg1 != NULL) {
        for (char* p = arg1; *p; p++) {
            *p = toupper(*p);
        }
    }
    
    // === System Commands ===
    if (strcmp(command, "CONFIG") == 0) {
        configMode = true;
        Serial.println(F("\n>>> CONFIG MODE ENABLED <<<"));
        printHelp();
        return;
    }
    
    if (strcmp(command, "EXIT") == 0) {
        configMode = false;
        fill_solid(leds_e, 3, CRGB::Black);
        Serial.println(F("<<< Config Mode Exited >>>"));
        return;
    }
    
    if (strcmp(command, "HELP") == 0) {
        printHelp();
        return;
    }
    
    if (strcmp(command, "STATUS") == 0) {
        printStatus();
        return;
    }
    
    if (strcmp(command, "INFO") == 0) {
        Serial.println(F("\n=== System Information ==="));
        Serial.print(F("Version: ")); Serial.println(VERSION);
        Serial.print(F("Free Heap: ")); Serial.print(ESP.getFreeHeap()); Serial.println(F(" bytes"));
        Serial.print(F("Total LEDs: ")); Serial.println(TOTAL_LEDS);
        Serial.print(F("Boot Count: ")); Serial.println(sysConfig.bootCount);
        Serial.print(F("R1/R2: "));
        Serial.print(sysConfig.voltageR1, 0);
        Serial.print(F("/"));
        Serial.println(sysConfig.voltageR2, 0);
        Serial.print(F("Voltage Limits (R/Y/G/C): "));
        Serial.print(sysConfig.limitRed, 2);
        Serial.print(F(" / "));
        Serial.print(sysConfig.limitYellow, 2);
        Serial.print(F(" / "));
        Serial.print(sysConfig.limitGreen, 2);
        Serial.print(F(" / "));
        Serial.println(sysConfig.limitCharge, 2);
        return;
    }
    
    // === Profile Commands ===
    if (strcmp(command, "SAVE") == 0) {
        if (arg1 != NULL) {
            int profileNum = atoi(arg1) - 1;
            saveProfile(profileNum);
        } else {
            Serial.println(F("ERROR: SAVE requires profile number (1-5)"));
        }
        return;
    }
    
    if (strcmp(command, "LOAD") == 0) {
        if (arg1 != NULL) {
            int profileNum = atoi(arg1) - 1;
            loadProfile(profileNum);
        } else {
            Serial.println(F("ERROR: LOAD requires profile number (1-5)"));
        }
        return;
    }
    
    if (strcmp(command, "DEFAULT") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 0 && val <= 5) {
                sysConfig.defaultProfile = val;
                if (saveSystemConfig()) {
                    Serial.print(F("Default profile set to: "));
                    Serial.println(val);
                } else {
                    Serial.println(F("ERROR: Failed to save config"));
                }
            } else {
                Serial.println(F("ERROR: DEFAULT must be 0-5 (0=off)"));
            }
        } else {
            Serial.println(F("ERROR: DEFAULT requires value (0-5, 0=off)"));
        }
        return;
    }
    
    // === Global Settings ===
    if (strcmp(command, "BRIGHTNESS") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 1 && val <= 100) {
                currentProfile.brightness = val;
                applyProfile();
                Serial.print(F("Brightness: ")); Serial.println(val);
            } else {
                Serial.println(F("ERROR: Brightness must be 1-100"));
            }
        } else {
            Serial.println(F("ERROR: BRIGHTNESS requires value (1-100)"));
        }
        return;
    }
    
