PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
    if (strcmp(command, "SPEED") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 1 && val <= 10) {
                currentProfile.animSpeed = val;
                Serial.print(F("DPL Speed: ")); Serial.println(val);
            } else {
                Serial.println(F("ERROR: Speed must be 1-10"));
            }
        } else {
            Serial.println(F("ERROR: SPEED requires value (1-10)"));
        }
        return;
    }
    
    if (strcmp(command, "CBISPEED") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 1 && val <= 10) {
                currentProfile.cbiSpeed = val;
                Serial.print(F("CBI Speed: ")); Serial.println(val);
            } else {
                Serial.println(F("ERROR: CBI Speed must be 1-10"));
            }
        } else {
            Serial.println(F("ERROR: CBISPEED requires value (1-10)"));
        }
        return;
    }
    
    if (strcmp(command, "PERSONALITY") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 0 && val < PERS_COUNT) {
                currentProfile.personality = val;
                applyProfile();
                Serial.println(F("Personality updated"));
            } else {
                Serial.println(F("ERROR: Personality must be 0-4"));
            }
        } else {
            Serial.println(F("ERROR: PERSONALITY requires value (0-4)"));
        }
        return;
    }
    
    if (strcmp(command, "SCHEME") == 0) {
        if (arg1 != NULL) {
            int8_t newScheme = -1;
            
            // Check named schemes
            if (strcmp(arg1, "CLASSIC") == 0) newScheme = CLASSIC;
            else if (strcmp(arg1, "BLUE") == 0) newScheme = BLUE;
            else if (strcmp(arg1, "PINK") == 0) newScheme = PINK;
            else if (strcmp(arg1, "GREEN") == 0) newScheme = GREEN;
            else if (strcmp(arg1, "CYBERPUNK") == 0) newScheme = CYBERPUNK;
            else if (strcmp(arg1, "FOREST") == 0) newScheme = FOREST;
            else if (strcmp(arg1, "SUNSET") == 0) newScheme = SUNSET;
            else if (strcmp(arg1, "CUSTOM") == 0) newScheme = CUSTOM;
            else {
                // Try numeric
                int schemeNum = atoi(arg1);
                if (schemeNum >= 0 && schemeNum < SCHEME_COUNT) {
                    newScheme = schemeNum;
                }
            }
            
            if (newScheme != -1) {
                currentProfile.colorScheme = newScheme;
                applyProfile();
                Serial.println(F("Scheme updated"));
            } else {
                Serial.println(F("ERROR: Invalid scheme. Type HELP for list"));
            }
        } else {
            Serial.println(F("ERROR: SCHEME requires name or number"));
        }
        return;
    }
    
    if (strcmp(command, "COLOR") == 0) {
        if (arg1 != NULL) {
            char* arg2 = strtok(NULL, " ");
            char* arg3 = strtok(NULL, " ");
            char* arg4 = strtok(NULL, " ");
            
            if (arg2 && arg3 && arg4) {
                uint8_t section = atoi(arg1);
                if (section < SEC_COUNT) {
                    currentProfile.customColors[section] = CRGB(atoi(arg2), atoi(arg3), atoi(arg4));
                    currentProfile.colorScheme = CUSTOM;
                    applyProfile();
                    Serial.println(F("Custom color set"));
                } else {
                    Serial.println(F("ERROR: Invalid section"));
                }
            } else {
                Serial.println(F("ERROR: COLOR requires: section(0-12) R(0-255) G(0-255) B(0-255)"));
            }
        } else {
            Serial.println(F("ERROR: COLOR requires: section(0-12) R(0-255) G(0-255) B(0-255)"));
        }
        return;
    }
    
    if (strcmp(command, "SEQUENCE") == 0) {
        if (arg1 != NULL) {
            if (strcmp(arg1, "ON") == 0) {
                currentProfile.sequenceMode = true;
                Serial.println(F("Sequence: ON"));
            } else if (strcmp(arg1, "OFF") == 0) {
                currentProfile.sequenceMode = false;
                Serial.println(F("Sequence: OFF"));
            } else {
                Serial.println(F("ERROR: Use ON or OFF"));
            }
        } else {
            Serial.println(F("ERROR: SEQUENCE requires ON or OFF"));
        }
        return;
    }
    
    if (strcmp(command, "VOLTAGE") == 0) {
        if (arg1 != NULL) {
            if (strcmp(arg1, "ON") == 0) {
                currentProfile.voltageMonitorEnabled = true;
                sysConfig.monitorVccEnabled = true;
                saveSystemConfig();
                Serial.println(F("Voltage Monitor: ON"));
            } else if (strcmp(arg1, "OFF") == 0) {
                currentProfile.voltageMonitorEnabled = false;
                sysConfig.monitorVccEnabled = false;
                saveSystemConfig();
                Serial.println(F("Voltage Monitor: OFF"));
            } else {
                Serial.println(F("ERROR: Use ON or OFF"));
            }
        } else {
            Serial.println(F("ERROR: VOLTAGE requires ON or OFF"));
        }
        return;
    }

    if (strcmp(command, "VM") == 0) {
        if (arg1 != NULL) {
            if (strcmp(arg1, "1") == 0 || strcmp(arg1, "ON") == 0) {
                currentProfile.voltageMonitorEnabled = true;
                sysConfig.monitorVccEnabled = true;
                saveSystemConfig();
                Serial.println(F("OK"));
            } else if (strcmp(arg1, "0") == 0 || strcmp(arg1, "OFF") == 0) {
                currentProfile.voltageMonitorEnabled = false;
                sysConfig.monitorVccEnabled = false;
                saveSystemConfig();
                Serial.println(F("OK"));
            } else {
                Serial.println(F("ERROR: VM requires 0 or 1"));
            }
        } else {
            Serial.println(F("ERROR: VM requires 0 or 1"));
        }
        return;
    }

    if (strcmp(command, "VL") == 0) {
        if (arg1 != NULL) {
            char* arg2 = strtok(NULL, " ");
            char* arg3 = strtok(NULL, " ");
            char* arg4 = strtok(NULL, " ");
            if (arg2 && arg3 && arg4) {
                sysConfig.limitRed = atof(arg1);
                sysConfig.limitYellow = atof(arg2);
                sysConfig.limitGreen = atof(arg3);
                sysConfig.limitCharge = atof(arg4);
                saveSystemConfig();
                Serial.println(F("OK"));
            } else {
                Serial.println(F("ERROR: VL requires RED YELLOW GREEN CHARGE"));
            }
        } else {
            Serial.println(F("ERROR: VL requires RED YELLOW GREEN CHARGE"));
        }
        return;
    }

