PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
    if (strcmp(command, "RR") == 0) {
        if (arg1 != NULL) {
            char* arg2 = strtok(NULL, " ");
            if (arg2) {
                sysConfig.voltageR1 = atof(arg1);
                sysConfig.voltageR2 = atof(arg2);
                saveSystemConfig();
                Serial.println(F("OK"));
            } else {
                Serial.println(F("ERROR: RR requires R1 R2"));
            }
        } else {
            Serial.println(F("ERROR: RR requires R1 R2"));
        }
        return;
    }
    
    // === Panel Modes ===
    if (strcmp(command, "LDPLMODE") == 0 || strcmp(command, "LLMODE") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 0 && val <= 3) {
                currentProfile.ldplMode = val;
                Serial.println(F("LDPL mode updated"));
            } else {
                Serial.println(F("ERROR: LDPLMODE must be 0-3"));
            }
        } else {
            Serial.println(F("ERROR: LDPLMODE requires value (0-3)"));
        }
        return;
    }
    
    if (strcmp(command, "CBIMODE") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 0 && val <= 6) {
                currentProfile.cbiMode = val;
                Serial.println(F("CBI mode updated"));
            } else {
                Serial.println(F("ERROR: CBIMODE must be 0-6"));
            }
        } else {
            Serial.println(F("ERROR: CBIMODE requires value (0-6)"));
        }
        return;
    }

    if (strcmp(command, "CSLMODE") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 0 && val <= 7) {
                currentProfile.cslMode = val;
                Serial.println(F("CSL mode updated"));
            } else {
                Serial.println(F("ERROR: CSLMODE must be 0-7"));
            }
        } else {
            Serial.println(F("ERROR: CSLMODE requires value (0-7)"));
        }
        return;
    }

    if (strcmp(command, "CSLSPEED") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 1 && val <= 10) {
                currentProfile.cslSpeed = val;
                Serial.println(F("CSL speed updated"));
            } else {
                Serial.println(F("ERROR: CSLSPEED must be 1-10"));
            }
        } else {
            Serial.println(F("ERROR: CSLSPEED requires value (1-10)"));
        }
        return;
    }

    if (strcmp(command, "CSLBRIGHTNESS") == 0) {
        if (arg1 != NULL) {
            int val = atoi(arg1);
            if (val >= 1 && val <= 100) {
                currentProfile.cslBrightness = val;
                Serial.println(F("CSL brightness updated"));
            } else {
                Serial.println(F("ERROR: CSLBRIGHTNESS must be 1-100"));
            }
        } else {
            Serial.println(F("ERROR: CSLBRIGHTNESS requires value (1-100)"));
        }
        return;
    }
    
    if (strcmp(command, "BARGRAPH") == 0) {
        if (arg1 != NULL) {
            if (strcmp(arg1, "SPLIT") == 0) {
                currentProfile.bargraphSplit = true;
                Serial.println(F("Bargraph: Split"));
            } else if (strcmp(arg1, "CLASSIC") == 0) {
                currentProfile.bargraphSplit = false;
                Serial.println(F("Bargraph: Classic"));
            } else {
                Serial.println(F("ERROR: Use SPLIT or CLASSIC"));
            }
        } else {
            Serial.println(F("ERROR: BARGRAPH requires SPLIT or CLASSIC"));
        }
        return;
    }
    
    if (strcmp(command, "TOPBLOCKS") == 0) {
        if (arg1 != NULL) {
            int mode = atoi(arg1);
            if (mode >= 0 && mode < TOPBLOCKS_MODE_COUNT) {
                currentProfile.topBlocksMode = mode;
                Serial.print(F("Top Blocks mode: "));
                Serial.println(mode);
            } else {
                Serial.println(F("ERROR: TOPBLOCKS must be 0-4"));
            }
        } else {
            Serial.println(F("ERROR: TOPBLOCKS requires value (0-4)"));
        }
        return;
    }
    
    // === Legacy Quick Commands ===
    if (command[0] == 'L' && strlen(command) == 2) {
        int mode = command[1] - '0';
        if (mode >= 0 && mode <= 3) {
            currentProfile.ldplMode = mode;
            Serial.print(F("LDPL Mode: ")); Serial.println(mode);
            return;
        }
    }
    
    if (command[0] == 'C' && strlen(command) == 2) {
        int mode = command[1] - '0';
        if (mode >= 0 && mode <= 6) {
            currentProfile.cbiMode = mode;
            Serial.print(F("CBI Mode: ")); Serial.println(mode);
            return;
        }
    }
    
    if (command[0] == 'P' && strlen(command) == 2) {
        int pers = command[1] - '0';
        if (pers >= 0 && pers < PERS_COUNT) {
            currentProfile.personality = pers;
            applyProfile();
            Serial.print(F("Personality: ")); Serial.println(pers);
            return;
        }
    }
    
    if (command[0] == 'S' && strlen(command) == 2) {
        int scheme = command[1] - '0';
        if (scheme >= 0 && scheme < SCHEME_COUNT) {
            currentProfile.colorScheme = scheme;
            applyProfile();
            Serial.print(F("Scheme: ")); Serial.println(scheme);
            return;
        }
    }
    
    // Unknown command
    Serial.println(F("Unknown command. Type HELP for list."));
}

// ============================================================================
// Config Mode Handler
// ============================================================================
void handleConfigMode() {
    static uint8_t blinkState = 0;
    EVERY_N_MILLISECONDS(500) {
        blinkState = !blinkState;
        fill_solid(leds_e, 3, blinkState ? CRGB::Blue : CRGB::Black);
        FastLED.show();
    }
}

// ============================================================================
// Animation Functions - DPL Panels
// ============================================================================
byte organicRandom(byte mode) {
    int8_t persParams[4];
    memcpy_P(persParams, PERSONALITY_PARAMS[currentProfile.personality], sizeof(persParams));
    mode = constrain(mode + (persParams[3] - 4), 0, 6);
    
