PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
    switch (mode) {
        case 0: return (random(256) & random(256) & random(256) & random(256));
        case 1: return (random(256) & random(256) & random(256));
        case 2: return (random(256) & random(256));
        case 3: return random(256);
        case 4: return (random(256) | random(256));
        case 5: return (random(256) | random(256) | random(256));
        case 6: return (random(256) | random(256) | random(256) | random(256));
        default: return random(256);
    }
}

void updateTopBlocks() {
    fill_solid(leds_d, NUM_LEDS_D, CRGB::Black);
    
    auto getPixelIndex = [](int col, int row) -> int {
        return (col < 3) ? (col + row * 3) : ((col - 3) + 9 + row * 3);
    };
    
    switch(currentProfile.topBlocksMode) {
        case TOPBLOCKS_CLASSIC: {
            int mask = random(64);
            if (bitRead(mask, 0)) { leds_d[0] = colorTable[SEC_TOP_YELLOW]; leds_d[3] = colorTable[SEC_TOP_YELLOW]; }
            if (bitRead(mask, 1)) { leds_d[3] = colorTable[SEC_TOP_YELLOW]; leds_d[6] = colorTable[SEC_TOP_YELLOW]; }
            if (bitRead(mask, 2)) { leds_d[1] = colorTable[SEC_TOP_YELLOW]; leds_d[4] = colorTable[SEC_TOP_YELLOW]; }
            if (bitRead(mask, 3)) { leds_d[4] = colorTable[SEC_TOP_YELLOW]; leds_d[7] = colorTable[SEC_TOP_YELLOW]; }
            if (bitRead(mask, 4)) { leds_d[2] = colorTable[SEC_TOP_YELLOW]; leds_d[5] = colorTable[SEC_TOP_YELLOW]; }
            if (bitRead(mask, 5)) { leds_d[5] = colorTable[SEC_TOP_YELLOW]; leds_d[8] = colorTable[SEC_TOP_YELLOW]; }
            
            int mask2 = random(64);
            if (bitRead(mask2, 0)) { leds_d[9]  = colorTable[SEC_TOP_GREEN]; leds_d[12] = colorTable[SEC_TOP_GREEN]; }
            if (bitRead(mask2, 1)) { leds_d[12] = colorTable[SEC_TOP_GREEN]; leds_d[15] = colorTable[SEC_TOP_GREEN]; }
            if (bitRead(mask2, 2)) { leds_d[10] = colorTable[SEC_TOP_GREEN]; leds_d[13] = colorTable[SEC_TOP_GREEN]; }
            if (bitRead(mask2, 3)) { leds_d[13] = colorTable[SEC_TOP_GREEN]; leds_d[16] = colorTable[SEC_TOP_GREEN]; }
            if (bitRead(mask2, 4)) { leds_d[11] = colorTable[SEC_TOP_GREEN]; leds_d[14] = colorTable[SEC_TOP_GREEN]; }
            if (bitRead(mask2, 5)) { leds_d[14] = colorTable[SEC_TOP_GREEN]; leds_d[17] = colorTable[SEC_TOP_GREEN]; }
            break;
        }
        
        case TOPBLOCKS_HORIZONTAL: {
            int row = random(3);
            for (int col = 0; col < 6; col++) {
                leds_d[getPixelIndex(col, row)] = (col < 3) ? 
                    colorTable[SEC_TOP_YELLOW] : colorTable[SEC_TOP_GREEN];
            }
            break;
        }
        
        case TOPBLOCKS_PAIRED: {
            int pair = random(2);
            for (int col = 0; col < 6; col++) {
                CRGB color = (col < 3) ? colorTable[SEC_TOP_YELLOW] : colorTable[SEC_TOP_GREEN];
                leds_d[getPixelIndex(col, pair)] = color;
                leds_d[getPixelIndex(col, pair + 1)] = color;
            }
            break;
        }
        
        case TOPBLOCKS_CHAOS: {
            for (int col = 0; col < 6; col++) {
                CRGB color = (col < 3) ? colorTable[SEC_TOP_YELLOW] : colorTable[SEC_TOP_GREEN];
                int pattern = random(6);
                switch(pattern) {
                    case 1: leds_d[getPixelIndex(col, 0)] = color; break;
                    case 2: leds_d[getPixelIndex(col, 1)] = color; break;
                    case 3: leds_d[getPixelIndex(col, 2)] = color; break;
                    case 4:
                        leds_d[getPixelIndex(col, 0)] = color;
                        leds_d[getPixelIndex(col, 1)] = color;
                        break;
                    case 5:
                        leds_d[getPixelIndex(col, 1)] = color;
                        leds_d[getPixelIndex(col, 2)] = color;
                        break;
                }
            }
            break;
        }
        
        case TOPBLOCKS_SINGLE: {
            leds_d[random(9)] = colorTable[SEC_TOP_YELLOW];
            leds_d[9 + random(9)] = colorTable[SEC_TOP_GREEN];
            break;
        }
    }
}

void updateBlueLEDs() {
    byte pattern = organicRandom(4);
    for (int i = 0; i < 6; i++) {
        leds_c[i * 4] = bitRead(pattern, i) ? colorTable[SEC_BLUE_COLUMN] : CRGB::Black;
    }
}

byte updateBar(byte* data, byte maxVal) {
    *data = constrain((int)(*data) + (random(3) - 1), 1, maxVal);
    return *data;
}

void updateBargraph() {
    if (currentProfile.bargraphSplit) {
        for (int bar = 0; bar < 2; bar++) {
            updateBar(&bargraphData[bar], 6);
        }
    } else {
        bargraphData[1] = updateBar(&bargraphData[0], 6);
    }
    
    for (int level = 0; level < 6; level++) {
        int baseIndex = (5 - level) * 4 + 1;
        
        CRGB colorL = (level < bargraphData[0]) ? 
            (level >= 4 ? colorTable[SEC_BARGRAPH_HIGH] : 
             level >= 2 ? colorTable[SEC_BARGRAPH_MID] : 
             colorTable[SEC_BARGRAPH_LOW]) : CRGB::Black;
        
        CRGB colorR = (level < bargraphData[1]) ? 
            (level >= 4 ? colorTable[SEC_BARGRAPH_HIGH] : 
             level >= 2 ? colorTable[SEC_BARGRAPH_MID] : 
             colorTable[SEC_BARGRAPH_LOW]) : CRGB::Black;
        
        leds_c[baseIndex] = colorL;
        leds_c[baseIndex + 1] = colorR;
        leds_c[baseIndex + 2] = colorL;
    }
}

void updateBottomLEDs() {
    byte pattern = organicRandom(4);
    for (int i = 0; i < 6; i++) {
        leds_a[i] = bitRead(pattern, i) ? colorTable[SEC_BOTTOM_WHITE] : CRGB::Black;
    }
}

void updateRedLEDs() {
    leds_a[6] = random(2) ? colorTable[SEC_RED_LARGE] : CRGB::Black;
    leds_a[7] = random(2) ? colorTable[SEC_RED_LARGE] : CRGB::Black;
}

void updateVuMeter() {
    if (currentProfile.colorScheme == PINK) {
        const TProgmemRGBPalette16 pinkPalette_p PROGMEM = {
            CRGB::DeepPink, CRGB::HotPink, CRGB::HotPink, CRGB::White,
            CRGB::HotPink, CRGB::DeepPink, CRGB::Red, CRGB::DeepPink,
            CRGB::DeepPink, CRGB::HotPink, CRGB::White, CRGB::White,
            CRGB::HotPink, CRGB::Red, CRGB::Red, CRGB::DeepPink
        };
        uint8_t pulse = beatsin8(45, 60, 255);
        uint8_t colorIndex = millis() / 15;
        fill_palette(leds_b, NUM_LEDS_B, colorIndex, 8, pinkPalette_p, pulse, LINEARBLEND);
    }
    else if (currentProfile.personality == HAPPY) {
        fill_rainbow(leds_b, NUM_LEDS_B, gHue, 7);
    }
    else if (currentProfile.personality == SLEEPY) {
        fill_solid(leds_b, NUM_LEDS_B, CHSV(160, 255, beatsin8(10, 30, 100)));
    }
    else {
        uint8_t beat = beatsin8(62, 64, 255);
        for (int i = 0; i < NUM_LEDS_B / 2; i++) {
            leds_b[i] = leds_b[NUM_LEDS_B - 1 - i] = CHSV(gHue + (i * 4), 255, beat);
        }
    }
}

// ============================================================================
// CBI Panel Functions
// ============================================================================
void getVCC() {
    int rawValue = analogRead(ANALOG_INPUT);
    float vout = (rawValue * ADC_REFERENCE_VOLTAGE) / ADC_MAX_VALUE;
    float vin = vout / (sysConfig.voltageR2 / (sysConfig.voltageR1 + sysConfig.voltageR2));
    
    leds_f[20] = (vin >= sysConfig.limitGreen) ? CRGB::Green : CRGB::Black;
    leds_f[21] = (vin < sysConfig.limitGreen && vin >= sysConfig.limitYellow) ? CRGB::Yellow : CRGB::Black;
    leds_f[22] = (vin < sysConfig.limitYellow) ? CRGB::Red : CRGB::Black;
}

