PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
void drawHeart() {
    int8_t pattern[20];
    memcpy_P(pattern, HEART_PATTERN, sizeof(pattern));
    for (int i = 0; i < 20; i++) {
        leds_f[i] = pattern[i] ? CRGB::Red : CRGB::Black;
    }
}

void drawSmiley() {
    int8_t pattern[20];
    memcpy_P(pattern, SMILEY_PATTERN, sizeof(pattern));
    for (int i = 0; i < 20; i++) {
        leds_f[i] = pattern[i] ? CRGB::Yellow : CRGB::Black;
    }
}

void matrixRain() {
    uint8_t count = currentProfile.voltageMonitorEnabled ? CBI_MATRIX_LEDS : NUM_LEDS_F;
    fadeToBlackBy(leds_f, count, 20);
    
    if (random8() < 30) {
        leds_f[random(5)] = CRGB::Green;
    }
    
    for (int r = 3; r > 0; r--) {
        for (int c = 0; c < 5; c++) {
            int srcIdx = (r - 1) * 5 + c;
            int dstIdx = r * 5 + c;
            if (leds_f[srcIdx].g > 0) {
                leds_f[dstIdx] = leds_f[srcIdx];
                leds_f[srcIdx].fadeToBlackBy(100);
            }
        }
    }
}

void updateCBIESB() {
    int8_t pattern[20];
    memcpy_P(pattern, ESB_PATTERNS[esbCounter], sizeof(pattern));
    for (int i = 0; i < 20; i++) {
        leds_f[i] = pattern[i] ? colorTable[SEC_CBI_MATRIX] : CRGB::Black;
    }
    esbCounter = (esbCounter + 1) % 28;
}

void updateCBILEDs() {
    static uint16_t specialCounter = 0;
    bool specialActive = false;
    
    uint8_t matrixCount = currentProfile.voltageMonitorEnabled ? CBI_MATRIX_LEDS : NUM_LEDS_F;
    
    if (currentProfile.personality == HAPPY && (specialCounter++ % SPECIAL_PATTERN_INTERVAL == 0)) {
        drawSmiley();
        specialActive = true;
    }
    else if (currentProfile.colorScheme == PINK && (specialCounter++ % SPECIAL_PATTERN_INTERVAL == 0)) {
        drawHeart();
        specialActive = true;
    }
    
    if (!specialActive) {
        switch (currentProfile.cbiMode) {
            case 0: // Organic
                for (int r = 0; r < 4; r++) {
                    byte p = organicRandom(random(4, 6));
                    for (int c = 0; c < 5; c++) {
                        leds_f[r * 5 + c] = bitRead(p, c) ? 
                            colorTable[SEC_CBI_MATRIX] : CRGB::Black;
                    }
                }
                break;
                
            case 1: // ESB
                updateCBIESB();
                break;
                
            case 2: // Rainbow
                fill_rainbow(leds_f, matrixCount, gHue, 7);
                break;
                
            case 3: // Sparkle
                fadeToBlackBy(leds_f, matrixCount, 10);
                leds_f[random16(matrixCount)] += CHSV(gHue + random8(64), 200, 255);
                break;
                
            case 4: // Heart
                drawHeart();
                break;
                
            case 5: // Smiley
                drawSmiley();
                break;
                
            case 6: // Matrix Rain
                matrixRain();
                break;
        }
    }
    
    if (currentProfile.voltageMonitorEnabled) {
        getVCC();
    }
}

// ============================================================================
// LDPL Functions
// ============================================================================
CRGB scaleModuleColor(const CRGB& color, uint8_t percent) {
    CRGB scaled = color;
    scaled.nscale8_video(map(percent, 1, 100, 10, 255));
    return scaled;
}

void updateCSL() {
    static uint8_t cslOffset = 0;
    fadeToBlackBy(leds_g, NUM_LEDS_G, 32);

    CRGB cslBase = scaleModuleColor(colorTable[SEC_CSL], currentProfile.cslBrightness);
    uint8_t glow = beatsin8(10 + currentProfile.cslSpeed, 20, 255);

    switch (currentProfile.cslMode) {
        case 0: // Off
            fill_solid(leds_g, NUM_LEDS_G, CRGB::Black);
            break;

        case 1: // Default
            for (int i = 0; i < NUM_LEDS_G; i += 6) {
                int pos = (i + cslOffset) % NUM_LEDS_G;
                leds_g[pos] = cslBase;
            }
            break;

        case 2: // Static color
            fill_solid(leds_g, NUM_LEDS_G, cslBase);
            break;

        case 3: { // Color glow
            CRGB glowColor = cslBase;
            glowColor.nscale8_video(glow);
            fill_solid(leds_g, NUM_LEDS_G, glowColor);
            break;
        }

        case 4: // Running lights 1
            for (int i = 0; i < NUM_LEDS_G; i += 3) {
                leds_g[(i + cslOffset) % NUM_LEDS_G] = cslBase;
            }
            break;

        case 5: // Running lights 2
            leds_g[cslOffset % NUM_LEDS_G] = cslBase;
            leds_g[(NUM_LEDS_G - 1 - cslOffset) % NUM_LEDS_G] = cslBase;
            break;

        case 6: // Running lights 3
            for (int i = 0; i < NUM_LEDS_G; i++) {
                if (((i + cslOffset) % 8) < 3) {
                    leds_g[i] = cslBase;
                }
            }
            break;

        case 7: { // Running lights 4
            int pos = beatsin16(10 + currentProfile.cslSpeed * 3, 0, NUM_LEDS_G - 1);
            leds_g[pos] = cslBase;
            if (pos > 0) leds_g[pos - 1] = scaleModuleColor(cslBase, currentProfile.cslBrightness / 2 + 1);
            if (pos < NUM_LEDS_G - 1) leds_g[pos + 1] = scaleModuleColor(cslBase, currentProfile.cslBrightness / 2 + 1);
            break;
        }
    }

    cslOffset = (cslOffset + 1) % NUM_LEDS_G;
}

void ldplBreathing() {
    uint8_t beat = beatsin8(5, 30, 255);
    CHSV color = rgb2hsv_approximate(colorTable[SEC_LDPL]);
    fill_solid(leds_e, NUM_LEDS_E, CHSV(color.h, color.s, beat));
}

void ldplPersonality() {
    switch (currentProfile.personality) {
        case HAPPY:
            fadeToBlackBy(leds_e, NUM_LEDS_E, 20);
            for (int i = 0; i < 8; i++) {
                leds_e[beatsin16(i + 7, 0, NUM_LEDS_E - 1)] |= CHSV(gHue + i * 32, 200, 255);
            }
            break;
            
        case GRUMPY:
            fill_solid(leds_e, NUM_LEDS_E, CHSV(0, 255, beatsin8(30, 10, 100)));
            break;
            
        case EXCITED:
            fill_rainbow(leds_e, NUM_LEDS_E, gHue * 3, 10);
            break;
            
        case SLEEPY:
            fill_solid(leds_e, NUM_LEDS_E, CHSV(160, 255, beatsin8(5, 10, 60)));
            break;
            
        default:
            ldplBreathing();
            break;
    }
}

void updateLDPL() {
    switch (currentProfile.ldplMode) {
        case 0: // Breathing
            ldplBreathing();
            break;
            
