PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
        case 1: // Rainbow
            fill_rainbow(leds_e, NUM_LEDS_E, gHue, 7);
            break;
            
        case 2: // Off
            fill_solid(leds_e, NUM_LEDS_E, CRGB::Black);
            break;
            
        case 3: // Personality
            ldplPersonality();
            break;
    }
}

// ============================================================================
// Startup Sequence
// ============================================================================
void startupSequence() {
    Serial.println(F("Running startup sequence..."));
    
    FastLED.clear();
    CRGB* strips[] = {leds_a, leds_b, leds_c, leds_d, leds_e, leds_f, leds_g};
    int counts[] = {NUM_LEDS_A, NUM_LEDS_B, NUM_LEDS_C, NUM_LEDS_D, NUM_LEDS_E, NUM_LEDS_F, NUM_LEDS_G};
    
    // Rainbow wave
    for (int hue = 0; hue < 255; hue += 64) {
        esp_task_wdt_reset();  // Feed watchdog during long animation
        for (int i = 0; i < TOTAL_LEDS; i++) {
            int current = 0;
            for (int s = 0; s < 7; s++) {
                if (i >= current && i < current + counts[s]) {
                    strips[s][i - current] = CHSV(hue, 255, 255);
                }
                current += counts[s];
            }
            FastLED.show();
            
            for (int s = 0; s < 7; s++) {
                fadeToBlackBy(strips[s], counts[s], 64);
            }
            delay(STARTUP_LED_DELAY);
        }
    }
    
    esp_task_wdt_reset();  // Feed watchdog before flash sequence
    
    // Flash all white
    for (int i = 0; i < 3; i++) {
        for (int s = 0; s < 7; s++) {
            fill_solid(strips[s], counts[s], CRGB::White);
        }
        FastLED.show();
        delay(STARTUP_FLASH_DELAY);
        
        FastLED.clear();
        FastLED.show();
        delay(STARTUP_FLASH_DELAY);
    }
    
    applyProfile();
    FastLED.show();
    Serial.println(F("Startup sequence complete!"));
}

// ============================================================================
// Setup Function
// ============================================================================
void setup() {
    Serial.begin(SERIAL_BAUD);
    delay(100);
    
    Serial.println(F("\n============================================"));
    Serial.print(F("RGB DPL Controller v"));
    Serial.println(VERSION);
    Serial.println(F("============================================"));
    
    // Configure voltage monitor thresholds
    GREEN_VCC = DEFAULT_LIMIT_GREEN;
    YELLOW_VCC = DEFAULT_LIMIT_YELLOW;
    RED_VCC = DEFAULT_LIMIT_RED;
    Serial.println(F("Voltage monitor defaults: 12V / 100k-10k"));
    
    // Initialize watchdog timer
    Serial.println(F("Enabling watchdog timer..."));
    #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // New API for ESP32 Arduino Core 3.x
    esp_task_wdt_config_t wdt_config = {
        .timeout_ms = WDT_TIMEOUT * 1000,
        .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
        .trigger_panic = true
    };
    esp_task_wdt_init(&wdt_config);
    esp_task_wdt_add(NULL);
    #else
    // Old API for ESP32 Arduino Core 2.x
    esp_task_wdt_init(WDT_TIMEOUT, true);
    esp_task_wdt_add(NULL);
    #endif
    
    // Initialize EEPROM
    Serial.println(F("Initializing EEPROM..."));
    if (!EEPROM.begin(EEPROM_SIZE)) {
        Serial.println(F("ERROR: EEPROM initialization failed!"));
        while(1) {
            delay(1000);
        }
    }
    
    // Configure GPIO
    pinMode(LEFT_DOOR_PIN, INPUT_PULLUP);
    pinMode(RIGHT_DOOR_PIN, INPUT_PULLUP);
    
    // Initialize I2C (no mutex needed with critical sections)
    Serial.println(F("Initializing I2C..."));
    Wire.begin(0x20);
    Wire.onReceive(i2cReceiveEvent);
    
    // Initialize FastLED
    Serial.println(F("Initializing LED strips..."));
    delay(100);
    
    FastLED.addLeds<WS2811, DATA_PIN_A, GRB>(leds_a, NUM_LEDS_A);
    FastLED.addLeds<WS2811, DATA_PIN_B, GRB>(leds_b, NUM_LEDS_B);
    FastLED.addLeds<WS2811, DATA_PIN_C, GRB>(leds_c, NUM_LEDS_C);
    FastLED.addLeds<WS2811, DATA_PIN_D, GRB>(leds_d, NUM_LEDS_D);
    FastLED.addLeds<WS2811, DATA_PIN_E, GRB>(leds_e, NUM_LEDS_E);
    FastLED.addLeds<WS2811, DATA_PIN_F, GRB>(leds_f, NUM_LEDS_F);
    FastLED.addLeds<WS2811, DATA_PIN_G, GRB>(leds_g, NUM_LEDS_G);
    
    set_max_power_in_volts_and_milliamps(5, 4000);
    
    // Load configuration
    Serial.println(F("Loading configuration..."));
    if (!loadSystemConfig()) {
        Serial.println(F("WARNING: System config load failed"));
    }
    
    Serial.print(F("Boot count: "));
    Serial.println(sysConfig.bootCount);
    
    if (sysConfig.defaultProfile > 0 && sysConfig.defaultProfile <= 5) {
        Serial.print(F("Loading default profile "));
        Serial.println(sysConfig.defaultProfile);
        if (!loadProfile(sysConfig.defaultProfile - 1)) {
            Serial.println(F("WARNING: Profile load failed, using defaults"));
            initDefaultProfile();
        }
    } else {
        Serial.println(F("No default profile, using defaults"));
        initDefaultProfile();
    }

    currentProfile.voltageMonitorEnabled = sysConfig.monitorVccEnabled;
    
    // Run startup sequence
    startupSequence();
    
    // System ready
    Serial.println(F("\n============================================"));
    Serial.println(F("System ready! Type HELP for commands."));
    Serial.println(F("============================================\n"));
    
    // Print health info
    Serial.print(F("Free heap: "));
    Serial.print(ESP.getFreeHeap());
    Serial.println(F(" bytes"));
}

// ============================================================================
// Main Loop
// ============================================================================
void loop() {
    // Feed watchdog
    esp_task_wdt_reset();
    
    // === Serial Input Handling ===
    if (Serial.available() > 0) {
        isWaitingForCommand = true;
        lastSerialActivityTime = millis();
        
