PrintedDroid/RGB-DPL-Firmware/RGB_DPL-ESP32_S3_Mini_v6.0/RGB_DPL-ESP32_S3_Mini_v6.0.ino
        while (Serial.available() > 0) {
            char inChar = Serial.read();
            
            if (inChar == '\n') {
                if (serialBufferPos > 0) {
                    serialBuffer[serialBufferPos] = '\0';
                    processSerialCommand();
                }
                serialBufferPos = 0;
                memset(serialBuffer, 0, sizeof(serialBuffer));
                isWaitingForCommand = false;
            }
            else if (inChar == '\r') {
                // Ignore carriage return
            }
            else if (inChar >= 32 && inChar < 127) {
                if (serialBufferPos < SERIAL_BUFFER_SIZE - 1) {
                    serialBuffer[serialBufferPos++] = inChar;
                } else {
                    // Buffer full - discard command
                    Serial.println(F("ERROR: Command too long"));
                    serialBufferPos = 0;
                    memset(serialBuffer, 0, sizeof(serialBuffer));
                    isWaitingForCommand = false;
                }
            }
        }
    }
    
    // Overflow-safe timeout check
    if (isWaitingForCommand) {
        uint32_t elapsed = millis() - lastSerialActivityTime;
        if (elapsed > SERIAL_TIMEOUT_MS) {
            isWaitingForCommand = false;
            serialBufferPos = 0;
            memset(serialBuffer, 0, sizeof(serialBuffer));
            Serial.println(F("ERROR: Command timeout"));
        }
    }
    
    // === Main Animation Logic ===
    if (!isWaitingForCommand) {
        // Process I2C commands (with critical section protection)
        bool localI2CCommandReady = false;
        portENTER_CRITICAL(&i2cMux);
        if (i2cCommandReady) {
            localI2CCommandReady = true;
            i2cCommandReady = false;
        }
        portEXIT_CRITICAL(&i2cMux);
        
        if (localI2CCommandReady) {
            processI2CCommand();
        }
        
        // Config mode takes priority
        if (configMode) {
            handleConfigMode();
            return;
        }
        
        // Sequence mode auto-cycling
        if (currentProfile.sequenceMode && sequenceTimer.ready()) {
            currentProfile.cbiMode = (currentProfile.cbiMode + 1) % 7;
            currentProfile.ldplMode = (currentProfile.ldplMode + 1) % 4;
            currentProfile.cslMode = (currentProfile.cslMode % 7) + 1;
        }
        
        // Calculate speed multipliers from personality
        int8_t persParams[4];
        memcpy_P(persParams, PERSONALITY_PARAMS[currentProfile.personality], sizeof(persParams));
        float globalSpeedMult = (persParams[0] / 10.0f) * (currentProfile.animSpeed / 5.0f);
        float cbiSpeedMult = (persParams[0] / 10.0f) * (currentProfile.cbiSpeed / 5.0f);
        
        // Update timer intervals
        topBlockTimer.setInterval(TOPBLOCK_BASE_INTERVAL / globalSpeedMult);
        blueTimer.setInterval(BLUE_BASE_INTERVAL / globalSpeedMult);
        bargraphTimer.setInterval(BARGRAPH_BASE_INTERVAL / globalSpeedMult);
        bottomTimer.setInterval(BOTTOM_BASE_INTERVAL / globalSpeedMult);
        redTimer.setInterval(RED_BASE_INTERVAL / globalSpeedMult);
        
        uint32_t cbiInterval = (currentProfile.cbiMode == 1) ? 
                               (CBI_ESB_INTERVAL / cbiSpeedMult) : 
                               (CBI_BASE_INTERVAL / cbiSpeedMult);
        cbiTimer.setInterval(cbiInterval);
        cslTimer.setInterval(map(currentProfile.cslSpeed, 1, 10, 240, 20));
        
        // === Left Door Panels ===
        if (digitalRead(LEFT_DOOR_PIN) == LOW) {
            if (topBlockTimer.ready()) updateTopBlocks();
            if (blueTimer.ready()) updateBlueLEDs();
            if (bargraphTimer.ready()) updateBargraph();
            if (bottomTimer.ready()) updateBottomLEDs();
            if (redTimer.ready()) updateRedLEDs();
            updateVuMeter();
        } else {
            // Door closed - turn off panels
            fill_solid(leds_a, NUM_LEDS_A, CRGB::Black);
            fill_solid(leds_b, NUM_LEDS_B, CRGB::Black);
            fill_solid(leds_c, NUM_LEDS_C, CRGB::Black);
            fill_solid(leds_d, NUM_LEDS_D, CRGB::Black);
        }
        
        // === Right Door Panel (CBI) ===
        if (digitalRead(RIGHT_DOOR_PIN) == LOW) {
            if (cbiTimer.ready()) {
                updateCBILEDs();
            }
        } else {
            fill_solid(leds_f, NUM_LEDS_F, CRGB::Black);
        }
        
        // === LDPL and CSL (always active) ===
        updateLDPL();
        if (cslTimer.ready()) updateCSL();
        
        // Update LEDs
        FastLED.show();
        
        // Global hue increment
        EVERY_N_MILLISECONDS(20) {
            gHue++;
            lHue++;
        }
    }
}
